//
//  Created on 01/02/2018.
//  Copyright © 2018 Institute of Microelectronics and Optoelectronics. All rights reserved.
//

#ifndef babelkowe_hpp
#define babelkowe_hpp

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Sortowanie bąbelkowe - do samodzielnej implementacji przez studenta
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//-----------------------------------------------------------------------------
// Metody zasadnicze
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
template <typename RECORD>
void Array<RECORD>::bubbleSort(Iterator first, Iterator last)
{
}
//-----------------------------------------------------------------------------
template <typename RECORD>
void Array<RECORD>::bubbleSortSmart(Iterator first, Iterator last)
{
}
//-----------------------------------------------------------------------------
template <typename RECORD>
void Array<RECORD>::shakerSort(Iterator first, Iterator last)
{
}
//-----------------------------------------------------------------------------
template <typename RECORD>
void Array<RECORD>::shakerSortSmart(Iterator first, Iterator last)
{
}
//-----------------------------------------------------------------------------



//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

#endif /* babelkowe_hpp */
